{"/BroadcastSuppression/Dev_KT":{"title":"Dev KT","data":{"":"","state-management#State Management":"All the state management for broadcast is under state.draftMessages as entire state management happens when the message is in draft stage\nNewly added state variables\nrestoredLandlineNumbers - (Only numbers restored from Landline tab of third panel - this is required when the number is restored from landline and upon adding one more number it would be broadcast, so in such cases the icon and color should be consistent)\nrestoredPhoneNumbers - All the phone numbers restored (includes landline)\ntimeFrame - to store the timeFrame edited in case of RecruiterControlled broadcast\nphoneTypes - Contains all the phoneTypes information\n\n\n\nThere is one exception though, when the chip is inserted in the input, we get the details from threads, so we store the threads in state.threadLists.threads. But all the information after receiving is being processed and put in the format in the above draftMessages state.\nAPI ChangesAll the API contracts details can be found in resources section of Broadcast Suppression. Below is just Gist.\nPOST phone-number-lookup we get information about the broadcast_suppression_status, type of the phone, all other details from this API, it is called on every chip change in the input box. Need to optimize. In order to get the above details, we need to pass in an extra parameter broadcastSuppressionSetting.\nGET messages_v2/thread-list, incase of broadcast chip, we get the details from this API. We need to pass 2 extra parameters broadcast_suppression_number: value ,broadcast_suppression_unit: value.","areas-to-test#Areas to test":"Web new message with individual and broadcast chips\nExtension Grab numbers and add numbers to contact\nTRM + Messaging integration"}},"/BroadcastSuppression/Resources":{"title":"Resources","data":{"":"","prd#PRD":"https://docs.google.com/document/d/1E_lnK1WWhq2ERaC-BQVbiE1uWMRW2p3ysKSzQoKu92g/edit","design-figma#Design Figma":"https://www.figma.com/file/2jYPmewNbPSqFZBoTWyx6i/Broadcast-Suppression?type=design&node-id=1-25403&t=gmK78WFGnAU3AzeA-0","backend-api-contracts#Backend API contracts":"https://www.notion.so/sensehq/Broadcast-Suppression-Spec-9aa74f0dda8e44f7981c91a37b202053","pull-request#Pull Request":"https://github.com/Spaced-Out/sense/pull/29931/files"}},"/BroadcastSuppression/Overview":{"title":"Overview","data":{"":"","need-for-broadcast-suppression#Need for Broadcast Suppression":"Broadcasts are one of the more dangerous features at Sense because they are likely to get carrier filtered.\nOne of the best ways to improve deliverability and avoid being filtered is to make sure the audience of a broadcast is better targeted and that recipients are not being inundated with redundant communication.","settings#Settings":"How to enable Broadcast Suppression\nCheck if Brodacast Suppression flag is enabled for the agency from admin page[https://admin-me.sensehq.com/admin/product-flags/release-flags]\n\n\n\nGo to Settings page and under role, select your role, options to set Broadcast Suppression. As Shown in the image below\n\n\nBroadcast Suppression\nType\nOff (default and there will not be any suppression)\nForced / Admin Controlled (numbers that have already received a message within the selected interval are automatically removed from the broadcast. )\nOptional / Recruiter Controlled (detected numbers are excluded from receiving the broadcast, but agents are given an option to add them back or to change the audience from agency wide to single phone number.)\n\n\nTime\nRecruiters can edit the default time frame. Whatever they select is preserved and applied to the next time they compose a broadcast message.Recruiters can edit the default time frame. Whatever they select is preserved and applied to the next time they compose a broadcast message.","broadcast-suppression-type---forced--admin-controlled#Broadcast Suppression Type - Forced / Admin Controlled":"The suppressed numbers cannot be added back and also recruiter will not be able to send any message","broadcast-suppression-type---optional--recruiter-controlled#Broadcast Suppression Type - Optional / Recruiter Controlled":"Recruiter can edit the default time frame and also add the suppressed numbers back. But the time frame edited will be only last for this instance of sending message unlike the timeframe edited in settings page"}},"/":{"title":"Introduction","data":{"":"Welcome to messaging docs."}},"/BroadcastSuppression/TestCases":{"title":"Testcases","data":{"":"","optional--recruiter-controlled#Optional / Recruiter Controlled":"Add single landline number\nThe number will be disabled shown under Landline number, can be restored from Landline tab.\n\n\nAdd single landline number and a number recently messaged\nThe numbers will be disabled and the both the numbers will be shown under recently messaged tab.\n\n\nAdd single landline number, then restore the landline and a number recently messaged\nLandline number will be restored and the icon will be phoneNumber and color would be red and recently messaged number will still be disabled.\n\n\nAdd single landline number, then restore the landline and a number recently messaged and then send a message\nLandline number will be restored and the icon will be phoneNumber and color would be red and recently messaged number will still be disabled. And the message will be sent to only landline number.\n\n\nAdd single landline number, then restore the landline and a number recently messaged, restore the recently messaged and then send a message\nMessages will be sent to both the numbers.\n\n\nAdd invalid number\nNumber will be shown under invalid tab and cannot be restored.\n\n\nBroadcast chip which has numbers which are all recently messaged\nChip will be disabled and there is option to restore the numbers\n\n\nBroadcast chip which has numbers which are invalid, recently messaged and landline\nChip will be disabled if all numbers are in one of the categories and send message button will be disabled and there is option to restore the numbers for landline and recently messaged.","forced--admin-controlled#Forced / Admin Controlled":"Add single landline number\nThe number will be disabled shown under Landline number, can be restored from Landline tab.\n\n\nAdd single landline number and a number recently messaged\nThe numbers will be disabled and the both the numbers will be shown under recently messaged tab.\n\n\nAdd single landline number, then restore the landline and a number recently messaged\nLandline number will be restored and the icon will be phoneNumber and color would be red and recently messaged number will still be disabled.\n\n\nAdd single landline number, then restore the landline and a number recently messaged and then send a message\nLandline number will be restored and the icon will be phoneNumber and color would be red and recently messaged number will still be disabled. And the message will be sent to only landline number.\n\n\nAdd single landline number, then restore the landline and a number recently messaged, there is no option to restore the recently messaged and then send a message\nMessgae will be sent only to landline number.\n\n\nAdd invalid number\nNumber will be shown under invalid tab and cannot be restored.\n\n\nBroadcast chip which has numbers which are all recently messaged\nChip will be disabled and there is no option to restore the numbers\n\n\nBroadcast chip which has numbers which are invalid, recently messaged and landline\nChip will be disabled if all numbers are in one of the categories and send message button will be disabled and there is option to restore the numbers for landline."}}}